module.exports = {
  semi: true, // Использовать точки с запятой в конце строк
  singleQuote: true, // Использовать одинарные кавычки вместо двойных
  trailingComma: "all", // Добавлять запятую в конце многострочных объектов и массивов
  printWidth: 120, // Максимальная ширина строки
  tabWidth: 2, // Ширина табуляции
  useTabs: false, // Использовать пробелы вместо табуляции
  jsxSingleQuote: false, // Использовать двойные кавычки в JSX
  bracketSpacing: true, // Добавлять пробелы между скобками объекта
  arrowParens: "always", // Всегда добавлять скобки вокруг параметров стрелочной функции
  endOfLine: "lf", // Использовать символ новой строки LF
};
